use Kazantseva_MyBase;

select Заказы.Наименование_заказанного_товара, Заказы.Дата_поставки, Товары.Цена
from Заказы, Товары
where Заказы.Наименование_заказанного_товара = Товары.Наименование_товара
and Заказы.Фирма_заказчик in (select Заказчики.Наименование_фирмы 
						from Заказчики
						where (Заказчики.Наименование_фирмы like '%Б%'))

select Заказы.Наименование_заказанного_товара, Заказы.Дата_поставки, Товары.Цена
from Заказы inner join Товары
on Заказы.Наименование_заказанного_товара = Товары.Наименование_товара
where Заказы.Фирма_заказчик in (select Заказчики.Наименование_фирмы 
						from Заказчики
						where (Заказчики.Наименование_фирмы like '%Б%'))

select distinct Заказы.Наименование_заказанного_товара, Заказы.Дата_поставки, Товары.Цена 
from Заказы inner join Товары
	on  Заказы.Наименование_заказанного_товара = Товары.Наименование_товара
	inner join Заказчики
		on Заказчики.Наименование_фирмы = Заказы.Фирма_заказчик
		where (Заказчики.Наименование_фирмы like '%Б%')

select Товары.Наименование_товара from Товары
where not exists (select * from Заказы 
				  where Заказы.Наименование_заказанного_товара = Товары.Наименование_товара) 

select Товары.Наименование_товара, Товары.Цена from Товары
	where Товары.Цена >=all (select Товары.Цена from ТОвары WHERE Товары.Наименование_товара like 'С%')

select Товары.Наименование_товара, Товары.Цена from Товары
	where Товары.Цена >any (select Товары.Цена from ТОвары WHERE Товары.Цена=15.5)







