use Kazantseva_MyBase;

go
create view [Заказанные товары]
as select Наименование_заказанного_товара[Товар],
	   Фирма_заказчик[Заказчик],
	   Дата_поставки[Дата] from Заказы

go
select * from [Заказанные товары]

go 
create view [Информация о заказах]
as select Заказы.Наименование_заказанного_товара [Товары],
		  Товары.Описание [Описание]
from Заказы inner join Товары
on Заказы.Наименование_заказанного_товара = Товары.Наименование_товара;

go 
alter view [Информация о заказах] with schemabinding
as select Заказы.Наименование_заказанного_товара [Товары],
		  Товары.Описание [Описание]
from dbo.Заказы inner join dbo.Товары
on Заказы.Наименование_заказанного_товара = Товары.Наименование_товара;

go
select * from [Информация о заказах]

go 
create view Дорогие_товары (Товар, Цена, Описание)
as select Наименование_товара, Цена, Описание from Товары
where Цена>0;

go
insert Дорогие_товары values('ножницы',20,'оаопвдлвалдпо');

go
alter view Дорогие_товары (Товар, Цена, Описание)
as select Наименование_товара, Цена, Описание from Товары
where Цена>0 WITH CHECK OPTION;

go
select * from [Дорогие_товары]

go 
create view Новые_дорогие_товары (Товар, Цена, Описание)
as select TOP 150 Наименование_товара, Цена, Описание from Товары
		  order by Наименование_товара

go
select * from [Новые_дорогие_товары]



